app/Controllers/AuthController.php

INSERT INTO `users` (`fullname`, `email`, `password`) VALUES ('Debashish', 'debashish.adcs@gmail.com', '$2y$10$0oWjQnrpzmTsI4Uo5h23o.g1EqMwhPMXettUFKBzCbCmj2UiRTkLS')
---
    public function storeUser(){
        $usermodel = new UserModel();
        $data = ['fullname' => $this->request->getPost('fullname'),
                'email' => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),];
        $usermodel->save($data);